#戴宁

手机：186-1402-5857
Email: ddai_android@126.com

男|1985年1月生|河北省廊坊市|本科


##概况

- 从新加坡的创业团队，到高德，新浪乐居的大型团队，期间积累了丰富得项目经验，团队管理经验，以及对Android等移动平台开发经验。
- 经历多个完整项目经验，从团队创建到稳定升级维护。
- 5年Android开发经验，2年其它移动平台开发经验（J2ME, BlackBerry）。
- 4年团队管理经验。
- 对项目框架，底层技术，针对Android项目优化，有丰富经验。

##经历

#####乐居，Android主管 — 2014-现在
负责房商部门Android开发团队。
从团队创建，到目前稳定升级维护。带领团队开发，客户端框架。
#####高德软件，Android高级工程师/主管 — 2013-2014
高德地图架构组，负责高德地图Android框架。
负责高德地图Android网络框架，任务池，缓存池等基础框架，参与插件化平台，负责代码质量检测，持续集成。
#####千尺无限, Android主管  — 2012-2013
负责Android开发团队。
带领团队开发，为产品策划评估需求，客户端框架，控制开发进度，项目优化，提高团队技术。
#####Singapore THS Mobile, Android工程师  — 2009-2012
完成客户端（Android, J2ME, BlackBerry）的后台实现。定义与服务器接口。
研究Push机制，完成公司核心PUSH技术的客户端实现。

##项目经验

#####新浪装修宝 	2013-2014
项目描述：	工长与业主沟通，对工长监督。
项目职责： 	带领团队开发，客户端框架，项目优化。维护团队气氛。

#####高德地图 Android客户端 	2013-2014
项目描述：	现高德主要产品。
在架构组，架构和代码优化；负责客户端网络任务，图片缓存；代码质量检测。
并发网络任务池框架，图片缓存框架，内部持续集成（CI），用户，消息，离线地图等功能。

#####千尺看图（图吧） 	2012-2013

项目描述： 	以图片为基础的社交APP，后于今日头条合并。
项目职责： 	带领团队开发，客户端框架，任务分配，完成客户端后台，控制开发进度，Review Code，项目优化。
项目业绩： 	带领团队在保证原有项目的进度下，两周内额外发出alpha版本，和IOS版本一起给新浪。

#####千尺下载/下载管家 	2012-2012

项目描述： 	下载加速工具，和内容管理。
项目职责： 	带领团队开发，任务分配，完成客户端后台，Review Code。
项目业绩： 	接手后重构项目，再新的框架和技术下，内存消耗大幅下降，更稳定流畅。并保证2-3周的更新速度。新功能的及时添加。并优化特有的下载引擎，给三星内置的游戏商店提供支持。
#####V-life 	2010-2012

项目描述： 	与越南运营商合作的类似赶集网，支持大客户的C2C交易平台。 
项目职责： 	实现Android, J2ME, Black Berry三个平台客户端后台（完成客户端50%的任务）
用户信息统计，和操作习惯的统计。
按地区，语言，宗教习惯等显示广告的平台（Android + PHP）
项目业绩： 	个人研究出（PHP + Ext JS + Sencha）的产品发布和展示，使运营人员可随时更新客户端的展示方式。支持大客户页面的定制。

#####Kerren SNS 	2010-2012

项目描述： 	与越南运营商合作的社区系统，并支持第三方（Facebook, Twitter）信息同步。
项目职责： 	实现Android, J2ME, Black Berry三个平台客户端后台 （完成客户端50%的任务）。
参照Facebook设计通信接口。
实现服务器部分（PHP + Mongo DB）
可以添加第三方如Facebook, Twitter。
项目业绩： 	设计Proxy访问Facebook, Twitter。

#####Kerren IM 	2010-2012

项目描述： 	与越南运营商合作的聊天软件，支持多媒体信息，群聊，支持添加第三方IM（MSN, YAHOO, GTalk），并互相通信。
项目职责： 	实现Android, J2ME, BlackBerry 三个平台客户端（客户端60%的任务）。
制定客户端与服务器通信接口。
实现添加第三方账号如MSN, YAHOO, GTalk等，并可以互相通信。
实现发送多媒体信息（File, Video, Audio, Location）的客户端和部分服务器。
项目业绩： 	优化消息队列，支持离线消息。
完成群聊功能（客户端和部分服务器）

#####Push Mail	2009-2010

项目描述： 	三个平台上 实现的Push Mail。
项目职责： 	实现Android, J2ME, Black Berry三个平台客户端后台
优化Email同步，实现本地与远程目录同步和管理。
参与完成 Web 方式的管理工具（PHP + Ext JS）

##教育经历
安徽建筑大学， 2005-2009，计算机科学与技术，本科
